In [69]:
import pandas as pd

dict1 = {
        'Name' : ["AL", 'Ka', 'Po', 'Lema', 'Zu', 'Ban', "Laoo"], 
        'Scores' : [6, 9, 5, 7, 2, 3, 9], 
        'Gender' : ["m", "f", 'm', 'f', 'f', 'm', 'm']
       }
df = pd.DataFrame(dict1)
df

   Name  Scores Gender
0    AL       6      m
1    Ka       9      f
2    Po       5      m
3  Lema       7      f
4    Zu       2      f
5   Ban       3      m
6  Laoo       9      m

In [7]:
df.head(3)

  Name   Scores Gender
0    AL       6      m
1    Ka       9      f
2    Po       5      m

In [8]:
df.tail(3)

  Name   Scores Gender
4    Zu       2      f
5   Ban       3      m
6  Laoo       9      m

In [9]:
df.shape

(7, 3)

In [10]:
print('Number of rows', df.shape[0])
print('Number of cols', df.shape[1])

Number of rows 7
Number of cols 3

#GET NO OF ROWS, COLS, DTYPE, AND MEM REQUIREMENT

df.info()

In [27]:
df.describe(include = 'all') #include all incorporates all values of the df

       Name     Scores Gender
count      7  7.000000      7
unique     7       NaN      2
top       AL       NaN      m
freq       1       NaN      4
mean     NaN  5.857143    NaN
std      NaN  2.734262    NaN
min      NaN  2.000000    NaN
25%      NaN  4.000000    NaN
50%      NaN  6.000000    NaN
75%      NaN  8.000000    NaN
max      NaN  9.000000    NaN

In [24]:
df.isnull().sum(axis = 0)

Name      0
Scores    0
Gender    0
dtype: int64

In [34]:
df['Gender'].unique() #finds the unique values of a column

array(['m', 'f'], dtype=object)

In [35]:
#NUMBER of unique values of a column
df['Gender'].nunique()

2

In [37]:
df['Gender'].value_counts() #shows both the unique values and their respective counts

Gender
m    4
f    3
Name: count, dtype: int64

In [41]:
#FINDING total number of people having scores between 6-10
df['Scores'].between(6, 10) #This will print T/F for the entries for which this range holds true
df['Scores'] >= 6 #Does the exact same thing, return a numpy table
df[df['Scores'] >= 6] #Does the same thing but returns a neat dataframe

  Name   Scores Gender
0    AL       6      m
1    Ka       9      f
3  Lema       7      f
6  Laoo       9      m

In [47]:
(df['Scores'] >= 6) & (df['Scores'] <= 10) #using paratheses to combine two ops, we can parse multiple conditions

0     True
1     True
2    False
3     True
4    False
5    False
6     True
Name: Scores, dtype: bool

In [50]:
df[(df['Scores'] >= 6) & (df['Scores'] <= 10)].count() #gives us total number for these assessments

Name      4
Scores    4
Gender    4
dtype: int64

In [53]:
len(df[(df['Scores'] >= 6) & (df['Scores'] <= 10)]) #same thing

4

In [55]:
#Finding average of the column

df['Scores'].mean()

5.857142857142857

In [56]:
#Finding median of column

df['Scores'].median()

6.0

In [57]:
def extra_credit(x):
    return x*2

In [62]:
df['Scores_EC'] = df['Scores'].apply(extra_credit)
df

  Name   Scores Gender  Scores_EC
0    AL       6      m         12
1    Ka       9      f         18
2    Po       5      m         10
3  Lema       7      f         14
4    Zu       2      f          4
5   Ban       3      m          6
6  Laoo       9      m         18

In [65]:
#Using lambda functions

df['Scores'].apply( lambda x: x*2)

0    12
1    18
2    10
3    14
4     4
5     6
6    18
Name: Scores, dtype: int64

In [70]:
df['Name'].count()

7

In [75]:
df['Gender'].map({'m':1, 'f':0})

0    1
1    0
2    1
3    0
4    0
5    1
6    1
Name: Gender, dtype: int64

In [86]:
#Now let's delete a column

df.drop('Scores_EC', axis = 1, inplace = True) #default in rows, change axis = 1 for columns
df

   Name  Scores Gender
0    AL       6      m
1    Ka       9      f
2    Po       5      m
3  Lema       7      f
4    Zu       2      f
5   Ban       3      m
6  Laoo       9      m

In [91]:
df.columns
df.index #rows

Index(['Name', 'Scores', 'Gender'], dtype='object')

In [94]:
df.sort_values(by = 'Scores', kind = 'stable') #can also specify the kind of sort you wanna use!

   Name  Scores Gender
4    Zu       2      f
5   Ban       3      m
2    Po       5      m
0    AL       6      m
3  Lema       7      f
1    Ka       9      f
6  Laoo       9      m

In [100]:
#display the scores of just the female students

df[df['Gender'] == 'f'][['Name', 'Scores']]

   Name  Scores
1    Ka       9
3  Lema       7
4    Zu       2